//  // Калькулятор ехзамен
// let san1 = +prompt("Бірінші сан енгіз")
// let san2 = +prompt("Екінші  сан енгіз")
// i=0

  
//  if (isNaN(san1) && isNaN(san2)) {
// alert(`Сіз не жазып кеттіңіз!!!`)
// } else if (san1,san1) {
// alert(` Қосындысы = ${san1+san2} 
//  Азаитындысы = ${san1-san2}
//  Көбейтіндісі  = ${san1*san2}
//  Бөліндісі  = ${san1/san2}`)
      
// }
 

let num =  50; 
 
  
 function sandar() { 
     while(true){ 
         let san = +prompt("Сан енгізіңіз: ") 
     if(num == san){ 
       alert("Керемет сіз санды таптыңыз!!!") 
     }else if(san < 0 || san > 100){ 
         alert("Қүып кеттіңіз!") 
     }  
      
     else if (num-5<=san && san<=num+5 ){ 
         alert(" Сіз жақындап қалдыңыз:  " ) 
     } 
     
     else{ 
         alert("Сіз алыстап кеттіңіз! ") 
     } 
     } 
  
 } 
 sandar();
















// . Тапсырма: Қарапайым калькулятор
// Пайдаланушыдан екі санды енгізу арқылы төрт негізгі математикалық операцияны орындау: қосу, алу, көбейту және бөлу.
// Тапсырманың талаптары:
// Пайдаланушыдан екі санды енгізуді сұрау.
// Егер пайдаланушы сан енгізбесе немесе дұрыс сан енгізбесе, "Қате енгізу!" деген хабарлама шығару.
// Қосындыны, айырманы, көбейтіндіні және бөліндіні есептеу.
// Қосымша талаптар:
// Пайдаланушыға дұрыс емес енгізулерді қайталауға мүмкіндік беру.
// Нәтижені экранға шығару




